## Day 1

In [1]:
import pandas as pd
import numpy as np

### Series

It is a one-dimensional of data. It is like a single column in a table.

You can have different types of data in a series, but be carefull if you want
only numerical data to be able to do some calculations.

In [2]:
# Let's create a series
dogs_breed_series = pd.Series(['French poodle', 'Bulldog', 'Labrador retriever', 789, 'Dachshund'])

In [3]:
dogs_breed_series

0         French poodle
1               Bulldog
2    Labrador retriever
3                   789
4             Dachshund
dtype: object

In [4]:
dogs_weigth_series = pd.Series([3, 4, 67, 23, 39, 19, 10, 9])

In [5]:
dogs_weigth_series

0     3
1     4
2    67
3    23
4    39
5    19
6    10
7     9
dtype: int64

Notice here the dtype is an integer here, while on the previous one it was an object (string will be see as an object in pandas).

The indexes (0, 1, 2, 3, ...) will be automatically assigned. BUt you can change that, like this:

In [6]:

# We can assign different indexes
dogs_weigth_serie = pd.Series(
    [3, 4, 67, 23, 39, 19, 10, 9],
    index = ['Cookie', 'Biscuit', 'Pepper', 'Apollo', 'Ginger', 'Ruby',
             "Spark", 'Peach'])

In [7]:
dogs_weigth_serie

Cookie      3
Biscuit     4
Pepper     67
Apollo     23
Ginger     39
Ruby       19
Spark      10
Peach       9
dtype: int64

## Statistics

Let's calculate the mean, median and mode.

These are function to study central tendency.

In [8]:
dogs_weigth_serie.mean()

21.75

In [9]:
dogs_weigth_serie.median()

14.5

In [10]:
dogs_weigth_serie.mode()

0     3
1     4
2     9
3    10
4    19
5    23
6    39
7    67
dtype: int64

In [11]:
# If we want to study the spread let use the standard deviation and the variance
dogs_weigth_serie.std()

21.783020910791965

In [12]:
dogs_weigth_serie.var()

474.5

# Dataframes

Dataframes are two-dimensional structures (rows, cols).

It has operations that allow you to manipulate numerical tables and time series.

Dataframes will be like you see in excel, but it will be more powerful.

There are multiple ways to define a dataframe.

In [13]:
# You can defined the dataframe by defining each series
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data = d)

In [14]:
df, df.dtypes

(   col1  col2
 0     1     3
 1     2     4,
 col1    int64
 col2    int64
 dtype: object)

In [15]:
# You can define the type of all the columns at once
df = pd.DataFrame(data=d, dtype=np.int8)
df, df.dtypes

(   col1  col2
 0     1     3
 1     2     4,
 col1    int8
 col2    int8
 dtype: object)

In [16]:
# You can define in the same ways, but directly including a Series
d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
df = pd.DataFrame(data=d, index=[0, 1, 2, 3])
df

   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

In [17]:
# Building from a numpy ndarray
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
    columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
# But the more practical approach is to build it from a list of dict
# This way you are sure that the data in each row is correct
df3 = pd.DataFrame.from_records(
    [{'points': 50, 'time': '5:00', 'year': 2010}, 
     {'points': 25, 'time': '6:00', 'month': "february", 'year': 2010}, 
     {'points':90, 'time': '9:00', 'month': 'january', 'year': 2020}, 
     {'points_h1':20, 'month': 'june', 'year': 2020}]
)
df3

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

In [19]:
#dtypes to see the types of each columns
df3.dtypes

points       float64
time          object
year           int64
month         object
points_h1    float64
dtype: object

In [20]:
# columns to see the name of all the columns. Some times you have
# so many columns that you do not see all in a screen.
df3.columns

Index(['points', 'time', 'year', 'month', 'points_h1'], dtype='object')

In [21]:
#shape
df3.shape

(4, 5)

In [22]:
#info
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   points     3 non-null      float64
 1   time       3 non-null      object
 2   year       4 non-null      int64
 3   month      3 non-null      object
 4   points_h1  1 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 292.0+ bytes

In [23]:
#describe, to show some statistic 
df3.describe()

          points         year  points_h1
count   3.000000     4.000000        1.0
mean   55.000000  2015.000000       20.0
std    32.787193     5.773503        NaN
min    25.000000  2010.000000       20.0
25%    37.500000  2010.000000       20.0
50%    50.000000  2015.000000       20.0
75%    70.000000  2020.000000       20.0
max    90.000000  2020.000000       20.0

In [24]:
#Head if you want to display just the first row, tail to display the last rows
df3.head(2)

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN

In [25]:
df3.tail(3)

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

In [26]:
df3[1:3]

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN

In [27]:
# You can select data from one column
df3['points']

0    50.0
1    25.0
2    90.0
3     NaN
Name: points, dtype: float64

In [28]:
# from multiple columns
df3[['points', 'time']]

   points  time
0    50.0  5:00
1    25.0  6:00
2    90.0  9:00
3     NaN   NaN

In [29]:
# You can use some conditions to filter the dataframe
df3[df3['points'] < 55]

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN

In [30]:
df3[(df3['points'] < 55) & (df3['time'] == '6:00')]

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN

In [31]:
df3[(df3['points'] < 55) | (df3['month'] == 'january')]

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN

In [32]:
# You can also use the function isin that is usefull
df3[(df3['points'] < 45) | (df3['month'].isin(['january', 'february']))]

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN

**Excersice 1:** https://github.com/novillo-cs/softdev_material/blob/main/classwork/unit_7/01_pandas.md

## Day 2

In [33]:
# You can set a column as the index
df3 = df3.set_index('points')

In [34]:
df3

        time  year     month  points_h1
points
50.0    5:00  2010       NaN        NaN
25.0    6:00  2010  february        NaN
90.0    9:00  2020   january        NaN
NaN      NaN  2020      june       20.0

In [35]:
# filter y index
df3.loc[[25.0]]

        time  year     month  points_h1
points
25.0    6:00  2010  february        NaN

In [36]:
# filter by index and column
df3.loc[25.0, 'month']

'february'

In [37]:
df3.loc[[25.0, 90.0]]

        time  year     month  points_h1
points
25.0    6:00  2010  february        NaN
90.0    9:00  2020   january        NaN

In [38]:
# selection by position with iloc
df3.iloc[0]

time         5:00
year         2010
month         NaN
points_h1     NaN
Name: 50.0, dtype: object

In [39]:
# iloc and column index
df3.iloc[0, 0]

'5:00'

In [40]:
# iloc and column name
df3.iloc[0].year

2010

In [41]:
# You can reset the index if you need to
df3 = df3.reset_index()
df3

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

In [42]:
df3

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

### Sort

In [43]:
# You can sort your dataframe as you want. Sort by one  column:
df3.sort_values('points')

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN
0    50.0  5:00  2010       NaN        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

In [44]:
# Multi-column sort
df3.sort_values(['year', 'month'])

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN
0    50.0  5:00  2010       NaN        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

In [45]:
# This time sorting by year ascending and by month descending
df3.sort_values(['year', 'month'], ascending=[True, False])

   points  time  year     month  points_h1
1    25.0  6:00  2010  february        NaN
0    50.0  5:00  2010       NaN        NaN
3     NaN   NaN  2020      june       20.0
2    90.0  9:00  2020   january        NaN

## Functions and Dataframes

In [46]:
df4 = pd.DataFrame.from_records([
    {'one_c': 1, "two_c": 2, "three_c": 3, "four_c": 4},
    {'one_c': 2, "two_c": 5, "three_c": 9, "four_c": 20},
    {'one_c': 3, "two_c": 6, "three_c": 12, "four_c": 100},
    {'one_c': 4, "two_c": 7, "three_c": 15, "four_c": 150},
])

In [47]:
df4

   one_c  two_c  three_c  four_c
0      1      2        3       4
1      2      5        9      20
2      3      6       12     100
3      4      7       15     150

In [48]:
#Let's see how to use some functions with dataframe
#Let's create a funcion just to multiply two values by np.pi
def multiple_example(value1, value2):
    return value1 * value2 * np.pi

In [49]:
# Let's use this function with our dataframe
# This line will apply the function to all rows
df4['five_c'] = multiple_example(df4['one_c'], df4['two_c'])

In [50]:
df4

   one_c  two_c  three_c  four_c     five_c
0      1      2        3       4   6.283185
1      2      5        9      20  31.415927
2      3      6       12     100  56.548668
3      4      7       15     150  87.964594

Great! Column five_c has exactly what we want, using the function with the dataframe applied the function to all rows.

This is perfect. We do not have to go over each row, because pandas takes care of that.

In [51]:
# We could have done it directly without using a funcion
df4['six_c'] = df4['one_c'] * df4['two_c'] * np.pi

In [52]:
df4

   one_c  two_c  three_c  four_c     five_c      six_c
0      1      2        3       4   6.283185   6.283185
1      2      5        9      20  31.415927  31.415927
2      3      6       12     100  56.548668  56.548668
3      4      7       15     150  87.964594  87.964594

For simple things like the multiplication example, you do not need to create a function.

However, when you need to implement something using loops or coditions, the best option is to create a function.

### Group by

In [53]:
df3

   points  time  year     month  points_h1
0    50.0  5:00  2010       NaN        NaN
1    25.0  6:00  2010  february        NaN
2    90.0  9:00  2020   january        NaN
3     NaN   NaN  2020      june       20.0

In [54]:
df3.groupby(['year'])

In [55]:
df3.groupby(['year']).sum()

      points      time        month  points_h1
year
2010    75.0  5:006:00     february        0.0
2020    90.0      9:00  januaryjune       20.0

In [56]:
# Columns different behavior. You can exclude columns if you want.
df3.groupby(['year']).agg({'points': 'mean', 'time': 'first', 'month': 'last'})

      points  time     month
year
2010    37.5  5:00  february
2020    90.0  9:00      june

## Read a CSV file

In [57]:
laptop_df = pd.read_csv('laptops.csv')

In [58]:
laptop_df

,brand,processor_brand,processor_name,processor_gnrtn,ram_gb,ram_type,ssd,hdd,os,os_bit,graphic_card_gb,weight,warranty,Touchscreen,msoffice,Price,rating,Number of Ratings,Number of Reviews
0,ASUS,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,34649,2.0,3,0
1,Lenovo,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,38999,3.0,65,5
2,Lenovo,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,39999,3.0,8,1
3,ASUS,Intel,Core i5,10th,8 GB,DDR4,512 GB,0 GB,Windows,32-bit,2 GB,Casual,No warranty,No,No,69990,3.0,0,0
4,ASUS,Intel,Celeron Dual,Not Available,4 GB,DDR4,0 GB,512 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,26990,3.0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
818,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,0 GB,Casual,1 year,No,No,135990,3.0,0,0
819,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,0 GB,Casual,1 year,No,No,144990,3.0,0,0
820,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,4 GB,Casual,1 year,No,No,149990,3.0,0,0
821,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,4 GB,Casual,1 year,No,No,142990,3.0,0,0
822,Lenovo,AMD,Ryzen 5,10th,8 GB,DDR4,512 GB,0 GB,DOS,64-bit,0 GB,ThinNlight,No warranty,No,No,57490,4.0,18,4

**Excersice 2:** https://github.com/novillo-cs/softdev_material/blob/main/classwork/unit_7/02_pandas

In [59]:
#Calculate the average price for each processor_brand and brand.
laptop_df.groupby(['processor_brand', 'brand']).Price.mean()

processor_brand  brand
AMD              ASUS       98378.030303
                 DELL       53808.451613
                 HP         66911.590909
                 Lenovo     72904.461538
                 MSI        75704.285714
                 acer       63304.600000
Intel            APPLE     173015.000000
                 ASUS       71926.300546
                 Avita      65157.428571
                 DELL       62775.600000
                 HP         76858.336957
                 Lenovo     72923.677966
                 MSI       102458.627907
                 acer       76218.138889
M1               APPLE     148156.666667
Name: Price, dtype: float64

In [60]:
#Calculate the total number of laptops for each ram_type and warranty
laptop_df.groupby(['ram_type', 'warranty']).size()

ram_type  warranty
DDR3      1 year           6
          No warranty      1
DDR4      1 year         451
          2 years         23
          3 years         11
          No warranty    224
DDR5      1 year           2
          No warranty      6
LPDDR3    1 year           7
          No warranty      7
LPDDR4    1 year           4
          No warranty     23
LPDDR4X   1 year          39
          3 years          2
          No warranty     17
dtype: int64

In [61]:
# Calculate the average rating for each os
# I do want to have a dataframe this time (and not a series)
# Let's have an index, the os column and a columns 'average_rating'
laptop_df.groupby(['os']).rating.mean().reset_index(name="average_rating")

        os  average_rating
0      DOS        3.562500
1      Mac        4.035714
2  Windows        3.545571

In [62]:
# Calculate the minimum laptop price for each warranty plan.
# same thing as before, in a dataframe with warranty and minimin_price column
laptop_df.groupby(['warranty']).Price.min().reset_index(name="minimum_price")

      warranty  minimum_price
0       1 year          23990
1      2 years          37990
2      3 years          64990
3  No warranty          16990

In [63]:
#Calculate the average number of reviews & price for laptops per touchscreen
# option and processor generation.
laptop_df.groupby(['Touchscreen', 'processor_gnrtn'])[['Number of Reviews', 'Price']].mean()

                             Number of Reviews          Price
Touchscreen processor_gnrtn
No          10th                     64.720207   85428.538860
            11th                     19.589091   68535.814545
            12th                      0.666667  239990.000000
            4th                      17.000000   52490.000000
            7th                       5.777778   57174.111111
            8th                      14.052632   84182.052632
            9th                      87.000000   87891.666667
            Not Available            57.611940   65206.074627
Yes         10th                      2.454545  163245.727273
            11th                      3.932203   88554.508475
            8th                       3.666667   90942.000000
            Not Available             4.083333  100552.625000

In [64]:
#Calculate the maximum and minimum price for each SSD and HDD combination.
laptop_df.groupby(['ssd', 'hdd']).Price.agg(['max', 'min'])

                    max     min
ssd     hdd
0 GB    1024 GB   93990   23990
        2048 GB   62317   62317
        512 GB   291190   16990
1024 GB 0 GB     309990   57900
128 GB  0 GB      76012   58100
        1024 GB  116941  116941
2048 GB 0 GB     233990  159990
256 GB  0 GB     136590   29890
        1024 GB  159990   39990
3072 GB 0 GB     441990  441990
512 GB  0 GB     244801   34990
        1024 GB  119990   80490
        512 GB   155411  125394

In [65]:
# Calculate the total number of reviews & average price for each weight, os ,
# and os_bit combination.
laptop_df.groupby(['weight', 'os', 'os_bit']).agg(
    {'Number of Reviews': 'sum',
     'Price': 'mean'}
)

                           Number of Reviews          Price
weight     os      os_bit
Casual     DOS     32-bit                980  130423.692308
           Mac     64-bit               3291  151707.857143
           Windows 32-bit               2891   73016.892857
                   64-bit              12214   81685.349367
Gaming     Windows 32-bit                  6   86490.000000
                   64-bit               2056   73550.486486
ThinNlight DOS     32-bit                109   97990.000000
                   64-bit                  4   57490.000000
           Windows 32-bit                258   49929.875000
                   64-bit               9144   60361.913043

In [66]:
# Calculate the mean price for each brand and subtract it from the
# individual laptop prices to obtain the price deviations
# => meaning laptop prices - the price corresponding to the mean of the laptop's brand
# tips: for the part of the second part (after the minus)
# check this function groupby transform, you are going to need it
# go check the documentation to learn about it
laptop_df.Price - laptop_df.groupby(['brand']).Price.transform('mean')

0     -44288.602410
1     -33921.208333
2     -32921.208333
3      -8947.602410
4     -51947.602410
           ...
818    57052.397590
819    66052.397590
820    71052.397590
821    64052.397590
822   -15430.208333
Name: Price, Length: 823, dtype: float64

In [67]:
#Calculate the weighted average of laptop prices based on the number of ratings for each `brand`
# tip: do you first group by
# then apply a function to this group by,

In [68]:
# this is the groupby by brand, then we are going to check a group
# here we list the keys
laptop_df.groupby('brand').groups.keys()

dict_keys(['APPLE', 'ASUS', 'Avita', 'DELL', 'HP', 'Lenovo', 'MSI', 'acer'])

In [69]:
# Let's check what do we see on the group "ASUS"
laptop_df.groupby('brand').get_group('ASUS')
# We have the dataframe corresponding for the groupby
# let's create a function that is going to have as entry this group
# we need to calculate the price average but weighted by the number of rating
# check the function the function np.average you will see an option
# for the weight
# Once you have you function, you just need to use the apply function after the
# the group by and use your function as argument for the apply function

,brand,processor_brand,processor_name,processor_gnrtn,ram_gb,ram_type,ssd,hdd,os,os_bit,graphic_card_gb,weight,warranty,Touchscreen,msoffice,Price,rating,Number of Ratings,Number of Reviews
0,ASUS,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,34649,2.0,3,0
3,ASUS,Intel,Core i5,10th,8 GB,DDR4,512 GB,0 GB,Windows,32-bit,2 GB,Casual,No warranty,No,No,69990,3.0,0,0
4,ASUS,Intel,Celeron Dual,Not Available,4 GB,DDR4,0 GB,512 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,26990,3.0,0,0
5,ASUS,Intel,Celeron Dual,Not Available,4 GB,DDR4,0 GB,512 GB,Windows,64-bit,0 GB,Casual,No warranty,No,No,22990,3.0,0,0
6,ASUS,Intel,Celeron Dual,Not Available,4 GB,DDR4,0 GB,512 GB,Windows,32-bit,0 GB,Casual,No warranty,No,No,21990,3.0,31,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
817,ASUS,AMD,Ryzen 9,Not Available,4 GB,LPDDR4X,1024 GB,0 GB,Windows,64-bit,4 GB,Casual,1 year,Yes,Yes,234990,3.0,0,0
818,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,0 GB,Casual,1 year,No,No,135990,3.0,0,0
819,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,0 GB,Casual,1 year,No,No,144990,3.0,0,0
820,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,4 GB,Casual,1 year,No,No,149990,3.0,0,0
821,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,4 GB,Casual,1 year,No,No,142990,3.0,0,0

In [70]:
def weighted_average(group):
    return np.average(group['Price'], weights=group['Number of Ratings'])

In [71]:
laptop_df.groupby('brand').apply(weighted_average)

/tmp/ipykernel_35190/3137604224.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  laptop_df.groupby('brand').apply(weighted_average)

brand
APPLE     103006.083523
ASUS       43576.376703
Avita      26035.342525
DELL       47335.321885
HP         48427.400434
Lenovo     49441.921962
MSI        67959.170969
acer       63083.558292
dtype: float64

In [72]:
# Calculate the percentage of laptops with `16 GB` RAM for each `brand` and `ram_type` combination.
def ram_percentage(group):
    return (group['ram_gb'] == '16 GB').mean() * 100

laptop_df.groupby(['brand', 'ram_type']).apply(ram_percentage)

/tmp/ipykernel_35190/2019175823.py:5: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  laptop_df.groupby(['brand', 'ram_type']).apply(ram_percentage)

brand   ram_type
APPLE   DDR3          0.000000
        DDR4         45.833333
        LPDDR4X      66.666667
ASUS    DDR3        100.000000
        DDR4         21.390374
        DDR5         20.000000
        LPDDR3       50.000000
        LPDDR4        0.000000
        LPDDR4X      32.352941
Avita   DDR4          7.142857
DELL    DDR3        100.000000
        DDR4          9.722222
        LPDDR4        0.000000
        LPDDR4X      25.000000
HP      DDR4         24.409449
        LPDDR3      100.000000
        LPDDR4        0.000000
        LPDDR4X      50.000000
Lenovo  DDR3          0.000000
        DDR4         16.666667
        LPDDR3      100.000000
        LPDDR4       25.000000
        LPDDR4X      33.333333
MSI     DDR4         42.105263
        DDR5         50.000000
        LPDDR4        0.000000
        LPDDR4X      33.333333
acer    DDR3          0.000000
        DDR4         20.930233
        DDR5          0.000000
        LPDDR4        0.000000
        LPDDR4X       0.000000
dtype: float64

In [73]:
# Calculate minimum and maximum ratings and their difference 
# for each processor brand & name combination
laptop_df.groupby(['processor_brand', 'processor_name']).agg({'rating': ['min', 'max', lambda x: x.max() - x.min()]})
# Then you can rename the columns if you want, to have something
# nicer to use it in your code

                               rating
                                  min  max <lambda_0>
processor_brand processor_name
AMD             Ryzen 3           3.0  4.0        1.0
                Ryzen 5           2.0  4.0        2.0
                Ryzen 7           2.0  5.0        3.0
                Ryzen 9           3.0  5.0        2.0
Intel           Celeron Dual      2.0  4.0        2.0
                Core i3           2.0  5.0        3.0
                Core i5           1.0  5.0        4.0
                Core i7           1.0  5.0        4.0
                Core i9           3.0  5.0        2.0
                Pentium Quad      3.0  4.0        1.0
                Ryzen 7           3.0  3.0        0.0
M1              M1                4.0  5.0        1.0

In [74]:
# Calculate the total number of ratings for each brand & processor_name 
# combination for laptops that have No warranty.
laptop_df[laptop_df['warranty'] == 'No warranty'].groupby(['brand', 'processor_name'])['Number of Ratings'].sum()

brand   processor_name
ASUS    Celeron Dual       4978
        Core i3             236
        Core i5            5002
        Core i7             604
        Core i9               0
        Pentium Quad          0
        Ryzen 5               4
        Ryzen 7            3298
        Ryzen 9              89
Avita   Celeron Dual       1120
        Core i5              51
        Core i7             207
DELL    Core i3            2846
        Core i5             623
        Core i7               0
        Ryzen 3             230
        Ryzen 5             394
        Ryzen 7             191
HP      Celeron Dual        886
        Core i3             418
        Core i5            2530
        Core i7               0
        Ryzen 3             163
        Ryzen 5              17
        Ryzen 7               0
Lenovo  Celeron Dual        873
        Core i3             383
        Core i5            6269
        Core i7              14
        Core i9               0
        Ryzen 3              38
        Ryzen 5             390
        Ryzen 7               4
MSI     Core i3             188
        Core i5            1742
        Core i7              52
        Core i9               0
        Ryzen 5            2441
        Ryzen 7               0
        Ryzen 9               0
acer    Celeron Dual         61
        Core i3              38
        Core i5           11013
        Ryzen 3               0
        Ryzen 5            2630
        Ryzen 7             141
Name: Number of Ratings, dtype: int64

In [75]:
# Calculate the percentage of each laptop's price compared to the
# maximum price within its brand and processor_name.
brand_max_price = laptop_df.groupby(['brand', 'processor_name'])['Price'].transform('max')
(laptop_df['Price'] / brand_max_price) * 100

0      66.645509
1      67.240814
2      68.964982
3      52.707282
4      90.297758
         ...
818    57.870548
819    61.700498
820    63.828248
821    60.849398
822    70.128571
Name: Price, Length: 823, dtype: float64

In [76]:
# You can loop over a groupby when sometimes, you need
# to do something that is not going to be done by the apply function
# (you need to do something on a multiprocessing, or something independant from
# pandas)
grouped = laptop_df.groupby(['brand', 'processor_name'])

In [77]:
# You can loop over you grouped
for group in grouped:
    # Some print o show you what is in print
    print("group")
    print(type(group))
    print(len(group))
    print(group[0])
    print(type(group[1]))
    # And then you can call whatever you want you have group[0] with the
    # group key and group[1] with the dataframe representing this key

group
<class 'tuple'>
2
('APPLE', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('APPLE', 'M1')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Celeron Dual')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Core i3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Core i9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Pentium Quad')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Ryzen 3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Ryzen 5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Ryzen 7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('ASUS', 'Ryzen 9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Avita', 'Celeron Dual')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Avita', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Avita', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Core i3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Pentium Quad')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Ryzen 3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Ryzen 5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('DELL', 'Ryzen 7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Celeron Dual')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Core i3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Pentium Quad')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Ryzen 3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Ryzen 5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Ryzen 7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('HP', 'Ryzen 9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Celeron Dual')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Core i3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Core i9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Ryzen 3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Ryzen 5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('Lenovo', 'Ryzen 7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Core i3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Core i9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Ryzen 5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Ryzen 7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('MSI', 'Ryzen 9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Celeron Dual')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Core i3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Core i5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Core i7')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Core i9')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Pentium Quad')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Ryzen 3')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Ryzen 5')
<class 'pandas.core.frame.DataFrame'>
group
<class 'tuple'>
2
('acer', 'Ryzen 7')
<class 'pandas.core.frame.DataFrame'>

In [78]:
# We saw the function apply for the group by.
# Let's see now the apply function for dataframe
# to do operation row by row

# Let's define a function with argument the memory string in the dataframe
# and return if the memory is True for large memory, False for small
# and None if we do not know what size of memory it is
def check_large_memory(memory_str):
    if memory_str[-2:] == "GB":
        memory = int(memory_str[:-2])
        if memory >= 16:
            return True
        else:
            return False
    else:
        return None

In [79]:
# check the documentation of the apply function (on a serie) and try to use it
# to run the check_large_memory function for every row
laptop_df['ram_gb'].apply(check_large_memory)

0      False
1      False
2      False
3      False
4      False
       ...
818    False
819    False
820    False
821    False
822    False
Name: ram_gb, Length: 823, dtype: bool

In [82]:
# You can use apply on multiple column also
# Let's write a function to calculate the total space disk
def total_space(ssd_space, hdd_space):
    if ssd_space[-2:] == "GB" and hdd_space[-2:] == "GB":
        ssd = int(ssd_space[:-2])
        hdd = int(hdd_space[:-2])
        return "{space} GB".format(space=ssd|+hdd)
    else:
        return None

In [83]:
# Now let's apply this function (doc on lambda: https://docs.python.org/3/tutorial/controlflow.html#lambda-expressions)
laptop_df.apply(lambda x: total_space(x['ssd'], x['hdd']), axis=1)

0      1024 GB
1      1024 GB
2      1024 GB
3       512 GB
4       512 GB
        ...
818    1024 GB
819    1024 GB
820    1024 GB
821    1024 GB
822     512 GB
Length: 823, dtype: object

In [86]:
# Now let return multiple columns with an apply
def split_ram(ram_str):
    if ram_str[-2:] == "GB":
        memory = int(ram_str[:-2])
        return memory, "GB"
    else:
        return None, None

In [87]:
laptop_df.ram_gb.apply(split_ram)

0      (4, GB)
1      (4, GB)
2      (4, GB)
3      (8, GB)
4      (4, GB)
        ...
818    (4, GB)
819    (4, GB)
820    (4, GB)
821    (4, GB)
822    (8, GB)
Name: ram_gb, Length: 823, dtype: object

In [91]:
# This does not give us 2 columns, so let's do a little bit of transforming
# to have 2 columns and then we can assign it on the datafram directly
laptop_df['ram_value'], laptop_df['ram_unit'] = zip(*laptop_df.ram_gb.apply(split_ram))

In [92]:
laptop_df

,brand,processor_brand,processor_name,processor_gnrtn,ram_gb,ram_type,ssd,hdd,os,os_bit,...,weight,warranty,Touchscreen,msoffice,Price,rating,Number of Ratings,Number of Reviews,ram_value,ram_unit
0,ASUS,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,...,Casual,No warranty,No,No,34649,2.0,3,0,4,GB
1,Lenovo,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,...,Casual,No warranty,No,No,38999,3.0,65,5,4,GB
2,Lenovo,Intel,Core i3,10th,4 GB,DDR4,0 GB,1024 GB,Windows,64-bit,...,Casual,No warranty,No,No,39999,3.0,8,1,4,GB
3,ASUS,Intel,Core i5,10th,8 GB,DDR4,512 GB,0 GB,Windows,32-bit,...,Casual,No warranty,No,No,69990,3.0,0,0,8,GB
4,ASUS,Intel,Celeron Dual,Not Available,4 GB,DDR4,0 GB,512 GB,Windows,64-bit,...,Casual,No warranty,No,No,26990,3.0,0,0,4,GB
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
818,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,...,Casual,1 year,No,No,135990,3.0,0,0,4,GB
819,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,...,Casual,1 year,No,No,144990,3.0,0,0,4,GB
820,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,...,Casual,1 year,No,No,149990,3.0,0,0,4,GB
821,ASUS,AMD,Ryzen 9,Not Available,4 GB,DDR4,1024 GB,0 GB,Windows,64-bit,...,Casual,1 year,No,No,142990,3.0,0,0,4,GB
822,Lenovo,AMD,Ryzen 5,10th,8 GB,DDR4,512 GB,0 GB,DOS,64-bit,...,ThinNlight,No warranty,No,No,57490,4.0,18,4,8,GB

In [ ]:
### Merge and Join
# Let's do some work where we need to regroup the data

In [93]:
movies_df = pd.read_csv('movies.csv')
ratings_df = pd.read_csv('ratings.csv')
tags_df = pd.read_csv('tags.csv')
links_df = pd.read_csv('links.csv')

In [98]:
#Let's have a look at this dataframes
movies_df, movies_df.dtypes

(      movieId                                      title  \
 0           1                           Toy Story (1995)
 1           2                             Jumanji (1995)
 2           3                    Grumpier Old Men (1995)
 3           4                   Waiting to Exhale (1995)
 4           5         Father of the Bride Part II (1995)
 ...       ...                                        ...
 9737   193581  Black Butler: Book of the Atlantic (2017)
 9738   193583               No Game No Life: Zero (2017)
 9739   193585                               Flint (2017)
 9740   193587        Bungo Stray Dogs: Dead Apple (2018)
 9741   193609        Andrew Dice Clay: Dice Rules (1991)

                                            genres
 0     Adventure|Animation|Children|Comedy|Fantasy
 1                      Adventure|Children|Fantasy
 2                                  Comedy|Romance
 3                            Comedy|Drama|Romance
 4                                          Comedy
 ...                                           ...
 9737              Action|Animation|Comedy|Fantasy
 9738                     Animation|Comedy|Fantasy
 9739                                        Drama
 9740                             Action|Animation
 9741                                       Comedy

 [9742 rows x 3 columns],
 movieId     int64
 title      object
 genres     object
 dtype: object)

In [99]:
ratings_df, ratings_df.dtypes

(        userId  movieId  rating   timestamp
 0            1        1     4.0   964982703
 1            1        3     4.0   964981247
 2            1        6     4.0   964982224
 3            1       47     5.0   964983815
 4            1       50     5.0   964982931
 ...        ...      ...     ...         ...
 100831     610   166534     4.0  1493848402
 100832     610   168248     5.0  1493850091
 100833     610   168250     5.0  1494273047
 100834     610   168252     5.0  1493846352
 100835     610   170875     3.0  1493846415

 [100836 rows x 4 columns],
 userId         int64
 movieId        int64
 rating       float64
 timestamp      int64
 dtype: object)

In [100]:
tags_df, tags_df.dtypes

(      userId  movieId               tag   timestamp
 0          2    60756             funny  1445714994
 1          2    60756   Highly quotable  1445714996
 2          2    60756      will ferrell  1445714992
 3          2    89774      Boxing story  1445715207
 4          2    89774               MMA  1445715200
 ...      ...      ...               ...         ...
 3678     606     7382         for katie  1171234019
 3679     606     7936           austere  1173392334
 3680     610     3265            gun fu  1493843984
 3681     610     3265  heroic bloodshed  1493843978
 3682     610   168248  Heroic Bloodshed  1493844270

 [3683 rows x 4 columns],
 userId        int64
 movieId       int64
 tag          object
 timestamp     int64
 dtype: object)

In [101]:
links_df, links_df.dtypes

(      movieId   imdbId    tmdbId
 0           1   114709     862.0
 1           2   113497    8844.0
 2           3   113228   15602.0
 3           4   114885   31357.0
 4           5   113041   11862.0
 ...       ...      ...       ...
 9737   193581  5476944  432131.0
 9738   193583  5914996  445030.0
 9739   193585  6397426  479308.0
 9740   193587  8391976  483455.0
 9741   193609   101726   37891.0

 [9742 rows x 3 columns],
 movieId      int64
 imdbId       int64
 tmdbId     float64
 dtype: object)

In [ ]:
# what you need to see are the columns that are related between
# the dataframes, like what we have in the database

In [ ]:
#Little exercise
#Drop duplicate movies based on title and keep the first occurence
# Go check drop_duplicates in the pandas documentation and
# and do this question
movies_df.drop_duplicates(subset=['title'], keep='first', inplace=True)

In [ ]:
# Explain merge with pandas
# https://pandas.pydata.org/docs/user_guide/merging.html#merge-types
# go over the examples of pandas documentation
# point the similarity with the database query
# Then let's the student do the exercice

In [103]:
# Merge movies_df & ratings_df with an inner join on movieId
movies_ratings_df = pd.merge(movies_df, ratings_df, on="movieId", how="inner")
# or you can use
movies_ratings_df = movies_df.merge(ratings_df, on="movieId", how="inner")

In [104]:
movies_ratings_df

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483
...,...,...,...,...,...,...
100831,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184,4.0,1537109082
100832,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184,3.5,1537109545
100833,193585,Flint (2017),Drama,184,3.5,1537109805
100834,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184,3.5,1537110021
100835,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331,4.0,1537157606

In [111]:
#Use the merged movies_ratings_df dataframe to calculate the average rating for each movie
movies_ratings_df.groupby("title")["rating"].mean()

title
'71 (2014)                                   4.000000
'Hellboy': The Seeds of Creation (2004)      4.000000
'Round Midnight (1986)                       3.500000
'Salem's Lot (2004)                          5.000000
'Til There Was You (1997)                    4.000000
                                               ...
eXistenZ (1999)                              3.863636
xXx (2002)                                   2.770833
xXx: State of the Union (2005)               2.000000
Three Amigos! (1986)                        3.134615
 nous la libert (Freedom for Us) (1931)    1.000000
Name: rating, Length: 9719, dtype: float64

In [112]:
# Merge movies_df & tags_df with a left join on movieId
movies_tags_df = pd.merge(movies_df, tags_df, on="movieId", how='left')
# or
movies_tags_df = movies_df.merge(tags_df, on="movieId", how='left')
movies_tags_df

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336.0,pixar,1.139046e+09
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474.0,pixar,1.137207e+09
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,567.0,fun,1.525286e+09
3,2,Jumanji (1995),Adventure|Children|Fantasy,62.0,fantasy,1.528844e+09
4,2,Jumanji (1995),Adventure|Children|Fantasy,62.0,magic board game,1.528844e+09
...,...,...,...,...,...,...
11848,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,NaN,NaN,NaN
11849,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,NaN,NaN,NaN
11850,193585,Flint (2017),Drama,NaN,NaN,NaN
11851,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,NaN,NaN,NaN
11852,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,NaN,NaN,NaN

In [113]:
# You see the difference if we do on the other way? Why we have this difference?
pd.merge(tags_df, movies_df, on="movieId", how='left')

,userId,movieId,tag,timestamp,title,genres
0,2,60756,funny,1445714994,Step Brothers (2008),Comedy
1,2,60756,Highly quotable,1445714996,Step Brothers (2008),Comedy
2,2,60756,will ferrell,1445714992,Step Brothers (2008),Comedy
3,2,89774,Boxing story,1445715207,Warrior (2011),Drama
4,2,89774,MMA,1445715200,Warrior (2011),Drama
...,...,...,...,...,...,...
3678,606,7382,for katie,1171234019,I'm Not Scared (Io non ho paura) (2003),Drama|Mystery|Thriller
3679,606,7936,austere,1173392334,Shame (Skammen) (1968),Drama|War
3680,610,3265,gun fu,1493843984,Hard-Boiled (Lat sau san taam) (1992),Action|Crime|Drama|Thriller
3681,610,3265,heroic bloodshed,1493843978,Hard-Boiled (Lat sau san taam) (1992),Action|Crime|Drama|Thriller
3682,610,168248,Heroic Bloodshed,1493844270,John Wick: Chapter Two (2017),Action|Crime|Thriller

In [115]:
# What is the other way to have the last result?
pd.merge(movies_df, tags_df, on="movieId", how='inner')

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336,pixar,1139045764
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474,pixar,1137206825
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,567,fun,1525286013
3,2,Jumanji (1995),Adventure|Children|Fantasy,62,fantasy,1528843929
4,2,Jumanji (1995),Adventure|Children|Fantasy,62,magic board game,1528843932
...,...,...,...,...,...,...
3678,187595,Solo: A Star Wars Story (2018),Action|Adventure|Children|Sci-Fi,62,star wars,1528934552
3679,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi,184,anime,1537098582
3680,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi,184,comedy,1537098587
3681,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi,184,gintama,1537098603
3682,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi,184,remaster,1537098592

In [114]:
#Use the merged dataframe movies_tags_df to select the movies with no tags
movies_tags_df[movies_tags_df['tag'].isnull()]

,movieId,title,genres,userId,tag,timestamp
9,4,Waiting to Exhale (1995),Comedy|Drama|Romance,NaN,NaN,NaN
12,6,Heat (1995),Action|Crime|Thriller,NaN,NaN,NaN
14,8,Tom and Huck (1995),Adventure|Children,NaN,NaN,NaN
15,9,Sudden Death (1995),Action,NaN,NaN,NaN
16,10,GoldenEye (1995),Action|Adventure|Thriller,NaN,NaN,NaN
...,...,...,...,...,...,...
11848,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,NaN,NaN,NaN
11849,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,NaN,NaN,NaN
11850,193585,Flint (2017),Drama,NaN,NaN,NaN
11851,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,NaN,NaN,NaN
11852,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,NaN,NaN,NaN

In [116]:
#Merge `tags_df` & `ratings_df` using the movie ID and the user ID
pd.merge(tags_df, ratings_df, on=["movieId", "userId"], how="outer", suffixes=('_tags', '_ratings'))

        userId  movieId  tag  timestamp_tags  rating  timestamp_ratings
0            1        1  NaN             NaN     4.0       9.649827e+08
1            5        1  NaN             NaN     4.0       8.474350e+08
2            7        1  NaN             NaN     4.5       1.106636e+09
3           15        1  NaN             NaN     2.5       1.510578e+09
4           17        1  NaN             NaN     4.5       1.305696e+09
...        ...      ...  ...             ...     ...                ...
102879     184   193581  NaN             NaN     4.0       1.537109e+09
102880     184   193583  NaN             NaN     3.5       1.537110e+09
102881     184   193585  NaN             NaN     3.5       1.537110e+09
102882     184   193587  NaN             NaN     3.5       1.537110e+09
102883     331   193609  NaN             NaN     4.0       1.537158e+09

[102884 rows x 6 columns]

In [117]:
# Merge movies_df dataframe & tag_counts series with the left dataframe on genres & the right series on its index
tag_counts = tags_df.tag.value_counts().rename("tag_count")
pd.merge(movies_df, tag_counts, left_on='genres', right_index=True)

,movieId,title,genres,tag_count
4,5,Father of the Bride Part II (1995),Comedy,4
8,9,Sudden Death (1995),Action,4
17,18,Four Rooms (1995),Comedy,4
18,19,Ace Ventura: When Nature Calls (1995),Comedy,4
58,65,Bio-Dome (1996),Comedy,4
...,...,...,...,...
9729,190219,Bunny (1998),Animation,1
9730,190221,Hommage Zgougou (et salut Sabine Mamou) (2...,Documentary,1
9735,193573,Love Live! The School Idol Movie (2015),Animation,1
9736,193579,Jon Stewart Has Left the Building (2015),Documentary,1
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,4

In [119]:
# Merge movies_df dataframe & rating_counts series using outer join with the left dataframe on movieId & the right series on its index

# number of times each movie has been rated
rating_counts = ratings_df.movieId.value_counts().rename("rating_count")
movies_ratings_counts_df = pd.merge(movies_df, rating_counts, how='outer', left_on='movieId', right_index=True)
movies_ratings_counts_df

,movieId,title,genres,rating_count
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,215.0
1,2,Jumanji (1995),Adventure|Children|Fantasy,110.0
2,3,Grumpier Old Men (1995),Comedy|Romance,52.0
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,7.0
4,5,Father of the Bride Part II (1995),Comedy,49.0
...,...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,1.0
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,1.0
9739,193585,Flint (2017),Drama,1.0
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,1.0
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,1.0

In [120]:
# Use the movies_ratings_counts_df dataframe to select the movies with no ratings
movies_ratings_counts_df[movies_ratings_counts_df['rating_count'].isnull()]

,movieId,title,genres,rating_count
816,1076,"Innocents, The (1961)",Drama|Horror|Thriller,NaN
2211,2939,Niagara (1953),Drama|Thriller,NaN
2499,3338,For All Mankind (1989),Documentary,NaN
2587,3456,"Color of Paradise, The (Rang-e khoda) (1999)",Drama,NaN
3118,4194,I Know Where I'm Going! (1945),Drama|Romance|War,NaN
4037,5721,"Chosen, The (1981)",Drama,NaN
4506,6668,"Road Home, The (Wo de fu qin mu qin) (1999)",Drama|Romance,NaN
4598,6849,Scrooge (1970),Drama|Fantasy|Musical,NaN
4704,7020,Proof (1991),Comedy|Drama|Romance,NaN
5020,7792,"Parallax View, The (1974)",Thriller,NaN
5293,8765,This Gun for Hire (1942),Crime|Film-Noir|Thriller,NaN
5421,25855,"Roaring Twenties, The (1939)",Crime|Drama|Thriller,NaN
5452,26085,Mutiny on the Bounty (1962),Adventure|Drama|Romance,NaN
5749,30892,In the Realms of the Unreal (2004),Animation|Documentary,NaN
5824,32160,Twentieth Century (1934),Comedy,NaN
5837,32371,Call Northside 777 (1948),Crime|Drama|Film-Noir,NaN
5957,34482,"Browning Version, The (1951)",Drama,NaN
7565,85565,Chalet Girl (2011),Comedy|Romance,NaN

In [ ]:
# Graph with pandas after learning matplotlib

In [ ]:


# pandas insert, update, delete data in django
# TODO: graph from pandas later
# pandas do some machine learning (regression, ...)